# tasks/facts.py

FACTS = {
    "beginner": [
        {
            "question": "Какой алфавит используется в хорватском языке?",
            "correct": "Латинский",
            "distractors": ["Кириллица", "Глаголица", "Греческий"],
            "advice": "Этот же алфавит был принят в качестве официальной письменности для сомалийского языка"
        },
        {
            "question": "Сколько букв в официальном хорватском алфавите?",
            "correct": "30",
            "distractors": ["26", "32", "33"],
            "advice": "Он включает специфические буквы: č, ć, dž, đ, lj, nj, š, ž."
        },
        {
            "question": "Сколько падежей в хорватском языке?",
            "correct": "7",
            "distractors": ["4", "6", "5"],
            "advice": "Их больше, чем в русском."
        },
    ],
    "intermediate": [
        {
            "question": "В каком хорватском городе находится старейший славянский университет в Европе?",
            "correct": "Загреб",
            "distractors": ["Сплит", "Риека", "Марибор"],
            "advice": "Через этот город протекает река Сава."
        },
        {
            "question": "Как называется славянская азбука, созданная на территории современной Хорватии?",
            "correct": "Углата глаголица",
            "distractors": ["Кириллица", "Латиница", "Обла глаголица"],
            "advice": "Её создал святой Кирилл, но она особенно прижилась в Хорватии."
        },
        {
            "question": "Какой из этих языков НЕ является частью сербохорватского?",
            "correct": "Словенский",
            "distractors": ["Боснийский", "Черногорский", "Хорватский"],
            "advice": "В этом языке существуют такие диалектные, как группы, как каринтийская, литтанская, штирийская, прекмурская, ровтская, приморская, внутреннесловенская"
        },
    ],
    "advanced": [
        {
            "question": "Какое из перечисленных языковых явлений характерно для хорватского, но отсутствует в русском?",
            "correct": "Наличие звательного падежа",
            "distractors": ["Три рода существительных", "Склонение прилагательных", "Будущее время глагола"],
            "advice": "В русском языке такое языковое явление сохранилось только в архаичных формах."
        },
        {
            "question": "Как в хорватском языке читается бука 'ř'?",
            "correct": "Такой буквы нет в хорватском языке",
            "distractors": ["Р", "Ч", "Ш"],
            "advice": "Вот ее транскрипция: []"
        },
        {
            "question": "Какой диалект лег в основу литературного хорватского языка?",
            "correct": "Штокавский",
            "distractors": ["Чакавский", "Кайкавский", "Прекмурский"],
            "advice": "Он используется чаще всего в Славонской жупании (область Хорватии)."
        },
    ]
}